# UIThemeManager Properties (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
UIThemeManager Properties
UIThemeManager Class See Also
---
The UIThemeManager type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CurrentTheme | The current theme. |
| DefaultTheme | The default theme. |

# See Also
UIThemeManager Class
Autodesk.Revit.UI Namespace